#+TITLE: Microservices in the fastlane
#+SUBTITLE: Deploying fast using Knative
#+AUTHOR: Caleb Woodbine <caleb@ii.coop>

#+begin_notes
Welcome to Microservices in the fastlane

Introductions
#+end_notes

* Set up :noexport:
Run reveal-multiplex locally
#+begin_src tmate :window reveal-multiplex
podman run -it --rm -p 1948:1948 registry.gitlab.com/ii/nz/reveal-multiplex
#+end_src

Set env for local reveal-multiplex server
#+begin_src elisp
(setenv "MULTIPLEX_URL" "http://localhost:1948")
(normal-mode)
#+end_src

Link up this folder to the web
#+begin_src tmate :window knativecon-eu-2022
export SHARINGIO_PAIR_EXPOSER_HOSTNAME=knativecon-eu-2022 APP_METRICS_ENABLED=false
echo "Talk available at: http://$SHARINGIO_PAIR_EXPOSER_HOSTNAME.${SHARINGIO_PAIR_BASE_DNS_NAME:-127.0.0.1.sslip.io:8080}"
go-http-server
#+end_src

Generate a token
#+begin_src shell
curl -s ${MULTIPLEX_URL:-reveal-multiplex.glitch.me}/token | jq .
#+end_src

#+RESULTS:
#+begin_example
{
  "secret": "16497298315862942442",
  "socketId": "854aeab6f5c1941d"
}
#+end_example
